# Data Cleaning and Preparation

In [1]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [2]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [3]:
float_data.notna()

0     True
1     True
2    False
3     True
dtype: bool

In [4]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [5]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [6]:
#string_data = string_data.dropna()
string_data = string_data.fillna("kk")
string_data

0    aardvark
1          kk
2          kk
3     avocado
dtype: object

## Filtering out Missing Data

In [7]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notna()] # ojo no es inplace!

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [11]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data.dropna(axis="columns")

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [13]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [17]:
df.dropna(thresh=3)

          0         1         2
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

# Data Transformation

In [18]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [19]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [20]:
data[~ data.duplicated()]

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [21]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [22]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [23]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [24]:
data.drop_duplicates(subset=["k1"], keep="last")

    k1  k2  v1
4  one   3   4
6  two   4   6

In [25]:
# pd.DataFrame.drop_duplicates?
# help(pd.DataFrame.drop_duplicates)

In [26]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                              "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [27]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [28]:
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [29]:
# or
def get_animal2(x):
    return meat_to_animal[x]
data["animal2"] = data["food"].map(get_animal2)
data

          food  ounces  animal animal2
0        bacon     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2        bacon    12.0     pig     pig
3     pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

## Replacing Values

In [30]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [31]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [32]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [33]:
display(data)
data.replace({-999:np.nan, -1000:0})

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [34]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
               index=["Ohio", "Colorado", "New York"],
               columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [35]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [36]:
def transform(x):
    return str.upper(x)

In [37]:
data.index.map(transform)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [38]:
data.index = data.index.map(transform)
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [39]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [40]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [41]:
data.rename(index={"OHIO": "INDIANA"}, 
           columns={"three": "peekaboo"})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

## Discretization and Binning

In [42]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
age_categories = pd.cut(ages, bins)
display(age_categories) # This is categorical
type(age_categories)

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

pandas.core.arrays.categorical.Categorical

In [43]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [44]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [45]:
pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [46]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [47]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, right=False, labels=group_names)

['Youth', 'Youth', 'YoungAdult', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [48]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [49]:
age_categories = pd.cut(ages, bins=2)
age_categories.codes

array([0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0], dtype=int8)

In [50]:
age_categories.categories

IntervalIndex([(19.959, 40.5], (40.5, 61.0]], dtype='interval[float64, right]')

In [51]:
pd.value_counts(age_categories)

(19.959, 40.5]    9
(40.5, 61.0]      3
dtype: int64

In [52]:
data=np.random.uniform(size=20)
data

array([0.0268, 0.8004, 0.9037, 0.0247, 0.4917, 0.5263, 0.5964, 0.052 ,
       0.8951, 0.7283, 0.8184, 0.5002, 0.8102, 0.096 , 0.219 , 0.2587,
       0.4681, 0.4594, 0.7095, 0.1781])

In [53]:
pd.cut(data, 4, precision=2)

[(0.024, 0.24], (0.68, 0.9], (0.68, 0.9], (0.024, 0.24], (0.46, 0.68], ..., (0.24, 0.46], (0.46, 0.68], (0.24, 0.46], (0.68, 0.9], (0.024, 0.24]]
Length: 20
Categories (4, interval[float64, right]): [(0.024, 0.24] < (0.24, 0.46] < (0.46, 0.68] < (0.68, 0.9]]

In [54]:
data = np.random.standard_normal(100)
display(data)
from scipy import stats
display(stats.describe(data)) #scipy

quartiles = pd.qcut(data, 4, precision=2)
quartiles

array([ 0.477 , -1.2659,  0.1198, -1.0635,  0.3329, -2.3594, -0.1995,
       -1.542 , -0.9707, -1.307 ,  0.2863,  0.378 , -0.7539,  0.3313,
        1.3497,  0.0699,  0.2467, -0.0119,  1.0048,  1.3272, -0.9193,
       -1.5491,  0.0222,  0.7584, -0.6605,  0.8626, -0.01  ,  0.05  ,
        0.6702,  0.853 , -0.9559, -0.0235, -2.3042, -0.6525, -1.2183,
       -1.3326,  1.0746,  0.7236,  0.69  ,  1.0015, -0.5031, -0.6223,
       -0.9212, -0.7262,  0.2229,  0.0513, -1.1577,  0.8167,  0.4336,
        1.0107,  1.8249, -0.9975,  0.8506, -0.1316,  0.9124,  0.1882,
        2.1695, -0.1149,  2.0037,  0.0296,  0.7953,  0.1181, -0.7485,
        0.585 ,  0.1527, -1.5657, -0.5625, -0.0327, -0.929 , -0.4826,
       -0.0363,  1.0954,  0.9809, -0.5895,  1.5817, -0.5287,  0.457 ,
        0.93  , -1.5693, -1.0225, -0.4028,  0.2205, -0.1934,  0.6692,
       -1.649 , -2.2528, -1.1668,  0.3536,  0.7021, -0.2746, -0.1391,
        0.1077, -0.6065, -0.4171, -0.017 , -1.2241, -1.8008,  1.6347,
        0.989 ,  0.4579])

DescribeResult(nobs=100, minmax=(-2.3594188073836815, 2.169461437689954), mean=-0.07511109072354842, variance=0.9389104213968468, skewness=-0.1437095251270181, kurtosis=-0.3609077229662683)

[(0.0061, 0.68], (-2.3699999999999997, -0.75], (0.0061, 0.68], (-2.3699999999999997, -0.75], (0.0061, 0.68], ..., (-2.3699999999999997, -0.75], (-2.3699999999999997, -0.75], (0.68, 2.17], (0.68, 2.17], (0.0061, 0.68]]
Length: 100
Categories (4, interval[float64, right]): [(-2.3699999999999997, -0.75] < (-0.75, 0.0061] < (0.0061, 0.68] < (0.68, 2.17]]

In [55]:
pd.value_counts(quartiles)

(-2.3699999999999997, -0.75]    25
(-0.75, 0.0061]                 25
(0.0061, 0.68]                  25
(0.68, 2.17]                    25
dtype: int64

In [56]:
 pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts() # Esto no lo he entendido!!

(-2.36, -1.31]      10
(-1.31, 0.00608]    40
(0.00608, 1.005]    40
(1.005, 2.169]      10
dtype: int64

## Detecting and Filtering Outliers

In [69]:
data = pd.DataFrame(np.random.standard_normal((1000,4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.024234    -0.076206     0.011361    -0.020429
std       1.027697     1.002410     0.995612     0.954246
min      -3.773343    -3.326219    -2.568047    -3.054285
25%      -0.677795    -0.788839    -0.684293    -0.681028
50%       0.020637    -0.042651     0.001658    -0.024870
75%       0.695055     0.602814     0.659570     0.599383
max       3.145329     3.349034     3.563584     2.842079

In [70]:
col = data[2]
col[col.abs()>3]

263    3.043319
474    3.563584
Name: 2, dtype: float64

In [71]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
58  -0.523341 -1.063036 -1.773809 -3.054285
263  0.788286  0.688234  3.043319 -0.521904
432 -3.221242 -0.269534  0.757189  1.491425
436 -3.150195  1.498909  0.478592 -1.985588
474 -0.335171 -0.289358  3.563584  0.998430
485  1.360403  3.349034  1.280963  0.886574
502  3.145329  0.542033  1.018252  0.304262
624 -3.773343 -2.561168 -0.154206  0.175596
663  0.747474 -3.326219  0.327072  1.807692
803  3.010842  1.395168  1.395673  0.181794

In [73]:
data[data.abs()>3] = np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.025223    -0.076229     0.010754    -0.020374
std       1.023527     1.000269     0.993625     0.954075
min      -3.000000    -3.000000    -2.568047    -3.000000
25%      -0.677795    -0.788839    -0.684293    -0.681028
50%       0.020637    -0.042651     0.001658    -0.024870
75%       0.695055     0.602814     0.659570     0.599383
max       3.000000     3.000000     3.000000     2.842079

## Permutation and Random Sampling

In [75]:
df = pd.DataFrame(np.arange(5*7).reshape((5,7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [79]:
sampler = np.random.permutation(5)
sampler

array([1, 2, 4, 0, 3])

In [80]:
df.take(sampler)

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27

In [82]:
df.iloc[sampler]

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27

In [85]:
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [86]:
col_sampler = np.random.permutation(7)
df.take(col_sampler, axis="columns")

    2   3   5   0   4   6   1
0   2   3   5   0   4   6   1
1   9  10  12   7  11  13   8
2  16  17  19  14  18  20  15
3  23  24  26  21  25  27  22
4  30  31  33  28  32  34  29

In [89]:
df.sample(n=3)

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13

In [91]:
choices = pd.Series([5,7,-1,6,4])
choices.sample(n=10, replace=True)

3    6
2   -1
4    4
4    4
2   -1
1    7
3    6
2   -1
0    5
2   -1
dtype: int64

In [97]:
choices.sample(n=10, replace=True)

1    7
2   -1
2   -1
0    5
1    7
3    6
2   -1
1    7
3    6
3    6
dtype: int64

## Computing Indicator/Dummy Variables

In [98]:
df = pd.DataFrame({"key": ["b","b","a","c","a","b"], "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [100]:
pd.get_dummies(df["key"])  # como en binario

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [102]:
dummies = pd.get_dummies(df["key"], prefix="key")
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [104]:
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [109]:
# system
import os
system = list(os.uname())[0]
if system == 'Linux':
    base_dir = "/home/emuro/git/github/"
elif system == 'Darwin':
    base_dir = "~/PycharmProjects/"
base_dir += "pydata-book/"

In [112]:
mnames = ["movie_id", "title", "genres"]
movies = pd.read_table(base_dir+"datasets/movielens/movies.dat", sep="::",
                       header=None, names=mnames, engine="python")
movies[:5]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [114]:
movies.shape

(3883, 3)

In [117]:
dummies = movies["genres"].str.get_dummies("|")
dummies

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0
2,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0
3,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
3879,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3880,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3881,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3882,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0

In [122]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))
movies_windic.iloc[0]

movie_id                                     1
title                         Toy Story (1995)
genres             Animation|Children's|Comedy
Genre_Action                                 0
Genre_Adventure                              0
                              ...
Genre_Romance                                0
Genre_Sci-Fi                                 0
Genre_Thriller                               0
Genre_War                                    0
Genre_Western                                0
Name: 0, Length: 21, dtype: object

In [127]:
np.random.seed(12345)
values = np.random.uniform(size=10)
display(values)
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

array([0.9296, 0.3164, 0.1839, 0.2046, 0.5677, 0.5955, 0.9645, 0.6532,
       0.7489, 0.6536])

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# Extension Data Types

## Conclusion